JulesCalella/ADB-02X/dsPIC33CH512MP506_Audio.c
#include <xc.h>
#include <math.h>
#include "dsPIC33CH512MP506_Audio.h"
#include "dsPIC33CH512MP506_Modules.h"
#include "dsPIC33CH512MP506_Pins.h"

/* controlArray Values:
 * 0 - Overtone 1 Amplitude
 * 1 - Overtone 2 Amplitude
 * 2 - Overtone 3 Amplitude
 * 3 - Overtone 4 Amplitude
 * 4 - Overtone 5 Amplitude
 * 5 - Overtone 6 Amplitude
 * 6 - Overtone 7 Amplitude
 * 7 - Overtone 8 Amplitude
 * 8 - Overtone 9 Amplitude
 * 9 - Sine Wave Amplitude
 * 10 - Square Wave Amplitude
 * 11 - Triangle Wave Amplitude
 * 12 - Sawtooth Wave Amplitude
 * 13 - Attack Value
 * 14 - Release Value
 * 15 - Function 1
 * 16 - Function 2
 * 17 - Function 3
 * */

int c1Waveform[C1_BUFF_SIZE];
int cSharp1Waveform[CSh1_BUFF_SIZE];
int d1Waveform[D1_BUFF_SIZE];
int dSharp1Waveform[DSh1_BUFF_SIZE];
int e1Waveform[E1_BUFF_SIZE];
int f1Waveform[F1_BUFF_SIZE];
int fSharp1Waveform[FSh1_BUFF_SIZE];
int g1Waveform[G1_BUFF_SIZE];
int gSharp1Waveform[GSh1_BUFF_SIZE];
int a1Waveform[A1_BUFF_SIZE];
int aSharp1Waveform[ASh1_BUFF_SIZE];
int b1Waveform[B1_BUFF_SIZE];
int emptyArray[1];
int controlArray[19];

int scoreArray1[ARRAY_SIZE_X][ARRAY_SIZE_Y];
int currentArrayX;
int currentArrayY;
int currentArray;
volatile int outputBuffer[ARRAY_OUTPUT_BUFFER];

timingStruct *timerAudio;

noteStruct notes[NUM_NOTES];

void loading(int isLoading)
{
    if(isLoading){
        timerAudio->loading = 1;
    } else {
        timerAudio->loading = 0;
    }

    timerAudio->loadingCount = 0;
    timerAudio->loadingDisplay = 0;
    updateNumberDisplay();
}

/*
 * 
 */
void generateAllWaveforms()
{
    loading(1);
    generateWaveform(c1Waveform, controlArray, C1_BUFF_SIZE);
    generateWaveform(cSharp1Waveform, controlArray, CSh1_BUFF_SIZE);
    generateWaveform(d1Waveform, controlArray, D1_BUFF_SIZE);
    generateWaveform(dSharp1Waveform, controlArray, DSh1_BUFF_SIZE);
    generateWaveform(e1Waveform, controlArray, E1_BUFF_SIZE);
    generateWaveform(f1Waveform, controlArray, F1_BUFF_SIZE);
    generateWaveform(fSharp1Waveform, controlArray, FSh1_BUFF_SIZE);
    generateWaveform(g1Waveform, controlArray, G1_BUFF_SIZE);
    generateWaveform(gSharp1Waveform, controlArray, GSh1_BUFF_SIZE);
    generateWaveform(a1Waveform, controlArray, A1_BUFF_SIZE);
    generateWaveform(aSharp1Waveform, controlArray, ASh1_BUFF_SIZE);
    generateWaveform(b1Waveform, controlArray, B1_BUFF_SIZE);
    emptyArray[0] = 0;
    loading(0);
}

/*
 * 
 */
void generateWaveform(int *audioArray, int *controlArray, int buffSize)
{
    clearAudioArray(audioArray, buffSize);
    if(controlArray[9] != 0)  generateSineWave(audioArray, controlArray[9], buffSize);
    if(controlArray[10] != 0) generateSquareWave(audioArray, controlArray[10], buffSize);
    if(controlArray[11] != 0) generateTriangleWave(audioArray, controlArray[11], buffSize);
    if(controlArray[12] != 0) generateSawWave(audioArray, controlArray[12], buffSize);
}

/*
 * 
 */
void generateSineWave(int *audioArray, int amplitude, int numBytes)
{
    int i, overtoneNum;
    float overtoneAmplitude;
    
    for(i=0; i<numBytes; i++){
        audioArray[i] += (AMPLITUDE_MULTIPLIER* (amplitude * sin(2.0 * PI * (i/(numBytes * 1.0)))));
    }
    
    // Overtones
    for(overtoneNum=0; overtoneNum<=8; overtoneNum++){
        if(controlArray[overtoneNum] != 0){
            overtoneAmplitude = (controlArray[overtoneNum]/100.0) * amplitude;
            for(i=0; i<numBytes; i++){
                audioArray[i] += (AMPLITUDE_MULTIPLIER * (overtoneAmplitude * sin(2.0 * PI * (overtoneNum+2) * (i/(numBytes * 1.0)))));
            }
        }
    }
}

/*
 * 
 */
void generateSquareWave(int *audioArray, int amplitude, int numBytes)
{
    int i, overtoneNum;
    float overtoneAmplitude;
    int numBytesDivTwo = numBytes/2;
    
    for(i=0; i<numBytes; i++){
        if(i<numBytesDivTwo){
            audioArray[i] += (AMPLITUDE_MULTIPLIER * amplitude);
        } else {
            audioArray[i] += (AMPLITUDE_MULTIPLIER * amplitude * -1);
        }
    }
    
    // Overtones
    int polarityThresh, toggleThreshHigh, toggleThreshLow;
    for(overtoneNum=0; overtoneNum<=8; overtoneNum++){
        if(controlArray[overtoneNum] != 0){
            overtoneAmplitude = (controlArray[overtoneNum] / 100.0) * amplitude;
            toggleThreshHigh = numBytes / (2 * (overtoneNum+2));
            toggleThreshLow = numBytes / (overtoneNum+2);
            polarityThresh = 0;
            
            for(i=0; i<numBytes; i++){
                if(polarityThresh < toggleThreshHigh){
                    audioArray[i] += (AMPLITUDE_MULTIPLIER * overtoneAmplitude);
                } else {
                    audioArray[i] += (AMPLITUDE_MULTIPLIER * overtoneAmplitude * -1);
                }
                polarityThresh++;
                if(polarityThresh >= toggleThreshLow) polarityThresh = 0;
            }
        }
    }
}

/*
 * 
 */
void generateTriangleWave(int *audioArray, int amplitude, int numBytes)
{
    int i, overtoneNum;
    float overtoneAmplitude;
    int firstLoopMax = numBytes/4;
    int secondLoopMax = (3*numBytes)/4;
    int halfWave = numBytes/2;
    
    for(i=0; i<firstLoopMax; i++){
        audioArray[i] += AMPLITUDE_MULTIPLIER * amplitude * (i/(firstLoopMax * 1.0));
    }
    
    for( ; i<secondLoopMax; i++){
        audioArray[i] += AMPLITUDE_MULTIPLIER * amplitude * ((i-firstLoopMax)/(-halfWave * 1.0)) + 1;
    }
    
    for( ; i<numBytes; i++){
        audioArray[i]  += AMPLITUDE_MULTIPLIER * amplitude * ((i-firstLoopMax)/(firstLoopMax * 1.0)) - 1;
    }
    
    // Overtones
    int counter, thirdLoopMax;
    for(overtoneNum=0; overtoneNum<=8; overtoneNum++){
        if(controlArray[overtoneNum] != 0){
            overtoneAmplitude = (controlArray[overtoneNum] / 100.0) * amplitude;
            firstLoopMax = numBytes / (4 * (overtoneNum + 2));
            secondLoopMax = (3 * numBytes) / (4 * (overtoneNum + 2));
            thirdLoopMax = numBytes / (overtoneNum + 2);
            halfWave = numBytes/(2*(overtoneNum+2));
            counter = 0;
            
            for(i=0; i<numBytes; i++){
                if(counter < firstLoopMax){
                    audioArray[i] += (AMPLITUDE_MULTIPLIER * overtoneAmplitude * (i/(firstLoopMax * 1.0)));
                } else if(counter < secondLoopMax){
                    audioArray[i] += (AMPLITUDE_MULTIPLIER * overtoneAmplitude * ((i-firstLoopMax)/(-halfWave * 1.0)) + 1);
                } else {
                    audioArray[i]  += (AMPLITUDE_MULTIPLIER * overtoneAmplitude * ((i-firstLoopMax)/(firstLoopMax * 1.0)) - 1);
                }
                counter++;
                if(counter>=thirdLoopMax) counter = 0;
            }
        }
    }
}

