JulesCalella/ADB-02X/dsPIC33CH512MP506_Audio.c
/*
 * 
 */
void generateSawWave(int *audioArray, int amplitude, int numBytes)
{
    int i, overtoneNum;
    float overtoneAmplitude;
    
    for(i=0; i<numBytes; i++){
        audioArray[i] += AMPLITUDE_MULTIPLIER * amplitude * (((2.0 * i)/numBytes) - 1);
    }
    
    // Overtones
    int counter, changeThresh;
    for(overtoneNum=0; overtoneNum<=8; overtoneNum++){
        if(controlArray[overtoneNum] != 0){
            overtoneAmplitude = (controlArray[overtoneNum]/100.0) * amplitude;
            changeThresh = numBytes / (overtoneNum + 2);
            counter = 0;
            
            for(i=0; i<numBytes; i++){
                audioArray[i] += AMPLITUDE_MULTIPLIER * overtoneAmplitude * (((2.0 * counter)/changeThresh) - 1);
                counter++;
                if(counter >= changeThresh) counter = 0;
            }
        }
    }
}

/*
 * 
 */
void clearAudioArray(int *audioArray, int numBytes)
{
    int i;
    
    for(i=0; i<numBytes; i++){
        audioArray[i] = 0;
    }
}

/*
 * 
 */
void defaultWaveformInit()
{
    controlArray[0] = 100;
    controlArray[1] = 100;
    controlArray[2] = 100;
    controlArray[3] = 100;
    controlArray[4] = 100;
    controlArray[5] = 100;
    controlArray[6] = 100;
    controlArray[7] = 100;
    controlArray[8] = 100;
    controlArray[9] = 100;
    controlArray[10] = 100;
    controlArray[11] = 100;
    controlArray[12] = 100;
    controlArray[13] = 50;
    controlArray[14] = 50;
    controlArray[15] = 0;
    controlArray[16] = 0;
    controlArray[17] = 0;
    controlArray[18] = 120;
}

/*
 * 
 */
void readControlArray(int *toReadArray)
{
    int i;
    for(i=0; i<19; i++){
        toReadArray[i] = controlArray[i];
    }
}

/*
 * 
 */
void writeControlArray(int *toWriteArray)
{
    int i;
    for(i=0; i<19; i++){
        controlArray[i] = toWriteArray[i];
    }
}

/*
 * 
 */
void notesInit(int *newOutput)
{
    int currentNote;
    
    for(currentNote=0; currentNote<NUM_NOTES; currentNote++){
        notes[currentNote].noteOn = 0;
        notes[currentNote].noteElement = 0;
        notes[currentNote].noteElementMax = 0;
        notes[currentNote].measureEnd = 0;
        notes[currentNote].locationEnd = 0;
        notes[currentNote].attackElement = 0;
        notes[currentNote].releaseElement = 0;
    }
    
    currentArrayX = 0;
    currentArrayY = 0;
    currentArray = 1;
    *newOutput = 1;
}

/*
 * 
 */
void updateOutputBuffer(int *newOutput)
{
    int noteNum, noteEnded;
    
    if(*newOutput != 0){
        *newOutput = 0;
        int output = 0;
        
        for(noteNum=0; noteNum<NUM_NOTES; noteNum++){
            if(notes[noteNum].noteOn == 1){
                noteEnded = 0;
                // Check if note is over
                if(notes[noteNum].measureEnd <= timerAudio->measure){
                    if((notes[noteNum].locationEnd <= timerAudio->location64) && (notes[noteNum].triplet == 0)){
                        notes[noteNum].noteOn = 0;
                        noteEnded = 1;
                    } else if((notes[noteNum].locationEnd <= timerAudio->location64Triplet)&&(notes[noteNum].triplet == 1)){
                        notes[noteNum].noteOn = 0;
                        noteEnded = 1;
                    }
                }
                
                if(noteEnded == 0){
                    // Write to output
                    output += notes[noteNum].noteArray[notes[noteNum].noteElement];
                    notes[noteNum].noteElement += exponentOfTwo(notes[noteNum].pitch);
                    if(notes[noteNum].noteElement >= notes[noteNum].noteElementMax){
                        notes[noteNum].noteElement -= notes[noteNum].noteElementMax;
                    }
                }
            }
        }
     
        output += AUDIO_OFFSET; // Offset
        
        spi1Write(output);
    }
}

/*
 * 
 */
void readScoreArray()
{
    int scoreMeasure, location, check;
    int updateScoreArray;
    
    do{
        updateScoreArray = 0;
        scoreMeasure = (scoreArray1[currentArrayX+2][currentArrayY] << 8) | scoreArray1[currentArrayX+3][currentArrayY];
        location = scoreArray1[currentArrayX+4][currentArrayY];

        if(scoreMeasure <= timerAudio->measure){
            if((location) <= timerAudio->location64){
                for(check=0; check<NUM_NOTES; check++){
                    if(notes[check].noteOn == 0){
                        updateNote(&notes[check], 0);
                        updateScoreArray = 1;
                        break;
                    }
                }   
            } 
//            else if(location <= (timing.location64Triplet | 0x80)){
//                for(check=0; check<NUM_NOTES; check++){
//                    if(notes[check].noteOn == 0){
//                        updateNote(&notes[check], 1);
//                        updateScoreArray = 1;
//                        break;
//                    }
//                }
//            }

            if(updateScoreArray == 1){
                currentArrayX += NOTE_ARRAY_SIZE;
                if(currentArrayX >= ARRAY_SIZE_X){
                    currentArrayX = 0;
                    currentArrayY++;
                    if(currentArrayY >= ARRAY_SIZE_Y){ 
                        currentArrayY = 0;
                        // End Song
                    }
                }
            }
        }
    } while(updateScoreArray == 1);
}

/*
 * 
 */
void updateNote(noteStruct *note, int isTriplet)
{
    int noteValue;
    
    note->noteOn = 1;
    note->noteElement = 0;
    noteValue = scoreArray1[currentArrayX][currentArrayY];
    note->pitch = scoreArray1[currentArrayX+1][currentArrayY];
    note->measureEnd = ((scoreArray1[currentArrayX+5][currentArrayY] << 8) | scoreArray1[currentArrayX+6][currentArrayY]);
    note->locationEnd = scoreArray1[currentArrayX+7][currentArrayY];
    if(isTriplet){ 
        note->triplet = 1;
    } else {
        note->triplet = 0;
    }

    switch(noteValue){
        case C:
            note->noteArray = c1Waveform;
            note->noteElementMax = C1_BUFF_SIZE;
            break;

        case Csh:
            note->noteArray = cSharp1Waveform;
            note->noteElementMax = CSh1_BUFF_SIZE;
            break;

