JulesCalella/ADB-02X/dsPIC33CH512MP506_Audio.c
        case D:
            note->noteArray = d1Waveform;
            note->noteElementMax = D1_BUFF_SIZE;
            break;

        case Dsh:
            note->noteArray = dSharp1Waveform;
            note->noteElementMax = DSh1_BUFF_SIZE;
            break;

        case E:
            note->noteArray = e1Waveform;
            note->noteElementMax = E1_BUFF_SIZE;
            break;

        case F:
            note->noteArray = f1Waveform;
            note->noteElementMax = F1_BUFF_SIZE;
            break;

        case Fsh:
            note->noteArray = fSharp1Waveform;
            note->noteElementMax = FSh1_BUFF_SIZE;
            break;

        case G:
            note->noteArray = g1Waveform;
            note->noteElementMax = G1_BUFF_SIZE;
            break;

        case Gsh:
            note->noteArray = gSharp1Waveform;
            note->noteElementMax = GSh1_BUFF_SIZE;
            break;

        case A:
            note->noteArray = a1Waveform;
            note->noteElementMax = A1_BUFF_SIZE;
            break;

        case Ash:
            note->noteArray = aSharp1Waveform;
            note->noteElementMax = ASh1_BUFF_SIZE;
            break;

        case B:
            note->noteArray = b1Waveform;
            note->noteElementMax = B1_BUFF_SIZE;
            break;
            
        default:
            note->noteArray = emptyArray;
            note->noteElementMax = 1;
            // TODO: Pauses Song and resets to beginning
    }
}

void setScoreArray(int x, int y)
{
    currentArrayX = x;
    currentArrayY = y;
    timerAudio->measure = 0;
    timerAudio->location64 = 0;
    timerAudio->location64Triplet = 0;
}

void linkTimer(timingStruct *timer)
{
    timerAudio = timer;
    timerAudio->interruptCount = 0;
    timerAudio->location64 = 0;
    timerAudio->location64Triplet = 0;
    timerAudio->measure = 0;
    updateTempo(120);
    timerAudio->loading = 0;
    timerAudio->loadingCount = 0;
    timerAudio->loadingDisplay = 0;
}

void updateTempo(int newTempo)
{
    timerAudio->tempo = newTempo;
    timerAudio->location64Max = (int)((1000.0/newTempo) * 375);
}

void writeSong(){
    scoreArray1[0][0] = C;  // Note
    scoreArray1[1][0] = 2;  // Pitch
    scoreArray1[2][0] = 0;  // Measure Start High
    scoreArray1[3][0] = 1;  // Measure Start Low
    scoreArray1[4][0] = 0;  // Location Start
    scoreArray1[5][0] = 0;  // Measure End High
    scoreArray1[6][0] = 1;  // Measure End Low
    scoreArray1[7][0] = 16; // Location End
    
    scoreArray1[10][0] = C;
    scoreArray1[11][0] = 2;
    scoreArray1[12][0] = 0;
    scoreArray1[13][0] = 1;
    scoreArray1[14][0] = 16;
    scoreArray1[15][0] = 0;
    scoreArray1[16][0] = 1;
    scoreArray1[17][0] = 32;
    
    scoreArray1[20][0] = G;
    scoreArray1[21][0] = 2;
    scoreArray1[22][0] = 0;
    scoreArray1[23][0] = 1;
    scoreArray1[24][0] = 32;
    scoreArray1[25][0] = 0;
    scoreArray1[26][0] = 1;
    scoreArray1[27][0] = 48;
    
    scoreArray1[30][0] = G;
    scoreArray1[31][0] = 2;
    scoreArray1[32][0] = 0;
    scoreArray1[33][0] = 1;
    scoreArray1[34][0] = 48;
    scoreArray1[35][0] = 0;
    scoreArray1[36][0] = 2;
    scoreArray1[37][0] = 0;
    
    scoreArray1[40][0] = A;
    scoreArray1[41][0] = 2;
    scoreArray1[42][0] = 0;
    scoreArray1[43][0] = 2;
    scoreArray1[44][0] = 0;
    scoreArray1[45][0] = 0;
    scoreArray1[46][0] = 2;
    scoreArray1[47][0] = 16;
    
    scoreArray1[50][0] = A;
    scoreArray1[51][0] = 2;
    scoreArray1[52][0] = 0;
    scoreArray1[53][0] = 2;
    scoreArray1[54][0] = 16;
    scoreArray1[55][0] = 0;
    scoreArray1[56][0] = 2;
    scoreArray1[57][0] = 32;
    
    scoreArray1[60][0] = G;
    scoreArray1[61][0] = 2;
    scoreArray1[62][0] = 0;
    scoreArray1[63][0] = 2;
    scoreArray1[64][0] = 32;
    scoreArray1[65][0] = 0;
    scoreArray1[66][0] = 3;
    scoreArray1[67][0] = 0;
    
    scoreArray1[0][1] = F;
    scoreArray1[1][1] = 2;
    scoreArray1[2][1] = 0;
    scoreArray1[3][1] = 3;
    scoreArray1[4][1] = 0;
    scoreArray1[5][1] = 0;
    scoreArray1[6][1] = 3;
    scoreArray1[7][1] = 16;
    
    scoreArray1[10][1] = F;
    scoreArray1[11][1] = 2;
    scoreArray1[12][1] = 0;
    scoreArray1[13][1] = 3;
    scoreArray1[14][1] = 16;
    scoreArray1[15][1] = 0;
    scoreArray1[16][1] = 3;
    scoreArray1[17][1] = 32;
    
    scoreArray1[20][1] = E;
    scoreArray1[21][1] = 2;
    scoreArray1[22][1] = 0;
    scoreArray1[23][1] = 3;
    scoreArray1[24][1] = 32;
    scoreArray1[25][1] = 0;
    scoreArray1[26][1] = 3;
    scoreArray1[27][1] = 48;
    
    scoreArray1[30][1] = E;
    scoreArray1[31][1] = 2;
    scoreArray1[32][1] = 0;
    scoreArray1[33][1] = 3;
    scoreArray1[34][1] = 48;
    scoreArray1[35][1] = 0;
    scoreArray1[36][1] = 4;
    scoreArray1[37][1] = 0;
    
    scoreArray1[40][1] = D;
    scoreArray1[41][1] = 2;
    scoreArray1[42][1] = 0;
    scoreArray1[43][1] = 4;
    scoreArray1[44][1] = 0;
    scoreArray1[45][1] = 0;
    scoreArray1[46][1] = 4;
    scoreArray1[47][1] = 16;
    
    scoreArray1[50][1] = D;
    scoreArray1[51][1] = 2;
    scoreArray1[52][1] = 0;
    scoreArray1[53][1] = 4;
    scoreArray1[54][1] = 16;
    scoreArray1[55][1] = 0;
    scoreArray1[56][1] = 4;
    scoreArray1[57][1] = 32;
    
    scoreArray1[60][1] = C;
    scoreArray1[61][1] = 2;
    scoreArray1[62][1] = 0;
    scoreArray1[63][1] = 4;
    scoreArray1[64][1] = 32;
    scoreArray1[65][1] = 0;
    scoreArray1[66][1] = 5;
    scoreArray1[67][1] = 0;
    
    scoreArray1[0][2] = G;
    scoreArray1[1][2] = 2;
    scoreArray1[2][2] = 0;
    scoreArray1[3][2] = 5;
    scoreArray1[4][2] = 0;
    scoreArray1[5][2] = 0;
    scoreArray1[6][2] = 5;
    scoreArray1[7][2] = 16;
    
    scoreArray1[10][2] = G;
    scoreArray1[11][2] = 2;
    scoreArray1[12][2] = 0;
    scoreArray1[13][2] = 5;
    scoreArray1[14][2] = 16;
    scoreArray1[15][2] = 0;
    scoreArray1[16][2] = 5;
    scoreArray1[17][2] = 32;
    
    scoreArray1[20][2] = F;
    scoreArray1[21][2] = 2;
    scoreArray1[22][2] = 0;
    scoreArray1[23][2] = 5;
    scoreArray1[24][2] = 32;
    scoreArray1[25][2] = 0;
    scoreArray1[26][2] = 5;
    scoreArray1[27][2] = 48;
    
