JulesCalella/ADB-02X/dsPIC33CH512MP506_Audio.c
    scoreArray1[30][2] = F;
    scoreArray1[31][2] = 2;
    scoreArray1[32][2] = 0;
    scoreArray1[33][2] = 5;
    scoreArray1[34][2] = 48;
    scoreArray1[35][2] = 0;
    scoreArray1[36][2] = 6;
    scoreArray1[37][2] = 0;
    
    scoreArray1[40][2] = E;
    scoreArray1[41][2] = 2;
    scoreArray1[42][2] = 0;
    scoreArray1[43][2] = 6;
    scoreArray1[44][2] = 0;
    scoreArray1[45][2] = 0;
    scoreArray1[46][2] = 6;
    scoreArray1[47][2] = 16;
    
    scoreArray1[50][2] = E;
    scoreArray1[51][2] = 2;
    scoreArray1[52][2] = 0;
    scoreArray1[53][2] = 6;
    scoreArray1[54][2] = 16;
    scoreArray1[55][2] = 0;
    scoreArray1[56][2] = 6;
    scoreArray1[57][2] = 32;
    
    scoreArray1[60][2] = D;
    scoreArray1[61][2] = 2;
    scoreArray1[62][2] = 0;
    scoreArray1[63][2] = 6;
    scoreArray1[64][2] = 32;
    scoreArray1[65][2] = 0;
    scoreArray1[66][2] = 7;
    scoreArray1[67][2] = 0;
    
    scoreArray1[0][3] = G;
    scoreArray1[1][3] = 2;
    scoreArray1[2][3] = 0;
    scoreArray1[3][3] = 7;
    scoreArray1[4][3] = 0;
    scoreArray1[5][3] = 0;
    scoreArray1[6][3] = 7;
    scoreArray1[7][3] = 16;
    
    scoreArray1[10][3] = G;
    scoreArray1[11][3] = 2;
    scoreArray1[12][3] = 0;
    scoreArray1[13][3] = 7;
    scoreArray1[14][3] = 16;
    scoreArray1[15][3] = 0;
    scoreArray1[16][3] = 7;
    scoreArray1[17][3] = 32;
    
    scoreArray1[20][3] = F;
    scoreArray1[21][3] = 2;
    scoreArray1[22][3] = 0;
    scoreArray1[23][3] = 7;
    scoreArray1[24][3] = 32;
    scoreArray1[25][3] = 0;
    scoreArray1[26][3] = 7;
    scoreArray1[27][3] = 48;
    
    scoreArray1[30][3] = F;
    scoreArray1[31][3] = 2;
    scoreArray1[32][3] = 0;
    scoreArray1[33][3] = 7;
    scoreArray1[34][3] = 48;
    scoreArray1[35][3] = 0;
    scoreArray1[36][3] = 8;
    scoreArray1[37][3] = 0;
    
    scoreArray1[40][3] = E;
    scoreArray1[41][3] = 2;
    scoreArray1[42][3] = 0;
    scoreArray1[43][3] = 8;
    scoreArray1[44][3] = 0;
    scoreArray1[45][3] = 0;
    scoreArray1[46][3] = 8;
    scoreArray1[47][3] = 16;
    
    scoreArray1[50][3] = E;
    scoreArray1[51][3] = 2;
    scoreArray1[52][3] = 0;
    scoreArray1[53][3] = 8;
    scoreArray1[54][3] = 16;
    scoreArray1[55][3] = 0;
    scoreArray1[56][3] = 8;
    scoreArray1[57][3] = 32;
    
    scoreArray1[60][3] = D;
    scoreArray1[61][3] = 2;
    scoreArray1[62][3] = 0;
    scoreArray1[63][3] = 8;
    scoreArray1[64][3] = 32;
    scoreArray1[65][3] = 0;
    scoreArray1[66][3] = 9;
    scoreArray1[67][3] = 0;
    
    scoreArray1[0][4] = C;  // Note
    scoreArray1[1][4] = 2;  // Pitch
    scoreArray1[2][4] = 0;  // Measure Start High
    scoreArray1[3][4] = 9;  // Measure Start Low
    scoreArray1[4][4] = 0;  // Location Start
    scoreArray1[5][4] = 0;  // Measure End High
    scoreArray1[6][4] = 9;  // Measure End Low
    scoreArray1[7][4] = 16; // Location End
    
    scoreArray1[10][4] = C;
    scoreArray1[11][4] = 2;
    scoreArray1[12][4] = 0;
    scoreArray1[13][4] = 9;
    scoreArray1[14][4] = 16;
    scoreArray1[15][4] = 0;
    scoreArray1[16][4] = 9;
    scoreArray1[17][4] = 32;
    
    scoreArray1[20][4] = G;
    scoreArray1[21][4] = 2;
    scoreArray1[22][4] = 0;
    scoreArray1[23][4] = 1;
    scoreArray1[24][4] = 32;
    scoreArray1[25][4] = 0;
    scoreArray1[26][4] = 1;
    scoreArray1[27][4] = 48;
    
    scoreArray1[30][4] = G;
    scoreArray1[31][4] = 2;
    scoreArray1[32][4] = 0;
    scoreArray1[33][4] = 9;
    scoreArray1[34][4] = 48;
    scoreArray1[35][4] = 0;
    scoreArray1[36][4] = 10;
    scoreArray1[37][4] = 0;
    
    scoreArray1[40][4] = A;
    scoreArray1[41][4] = 2;
    scoreArray1[42][4] = 0;
    scoreArray1[43][4] = 10;
    scoreArray1[44][4] = 0;
    scoreArray1[45][4] = 0;
    scoreArray1[46][4] = 10;
    scoreArray1[47][4] = 16;
    
    scoreArray1[50][4] = A;
    scoreArray1[51][4] = 2;
    scoreArray1[52][4] = 0;
    scoreArray1[53][4] = 10;
    scoreArray1[54][4] = 16;
    scoreArray1[55][4] = 0;
    scoreArray1[56][4] = 10;
    scoreArray1[57][4] = 32;
    
    scoreArray1[60][4] = G;
    scoreArray1[61][4] = 2;
    scoreArray1[62][4] = 0;
    scoreArray1[63][4] = 10;
    scoreArray1[64][4] = 32;
    scoreArray1[65][4] = 0;
    scoreArray1[66][4] = 11;
    scoreArray1[67][4] = 0;
    
    scoreArray1[0][5] = F;
    scoreArray1[1][5] = 2;
    scoreArray1[2][5] = 0;
    scoreArray1[3][5] = 11;
    scoreArray1[4][5] = 0;
    scoreArray1[5][5] = 0;
    scoreArray1[6][5] = 11;
    scoreArray1[7][5] = 16;
    
    scoreArray1[10][5] = F;
    scoreArray1[11][5] = 2;
    scoreArray1[12][5] = 0;
    scoreArray1[13][5] = 11;
    scoreArray1[14][5] = 16;
    scoreArray1[15][5] = 0;
    scoreArray1[16][5] = 11;
    scoreArray1[17][5] = 32;
    
    scoreArray1[20][5] = E;
    scoreArray1[21][5] = 2;
    scoreArray1[22][5] = 0;
    scoreArray1[23][5] = 11;
    scoreArray1[24][5] = 32;
    scoreArray1[25][5] = 0;
    scoreArray1[26][5] = 11;
    scoreArray1[27][5] = 48;
    
    scoreArray1[30][5] = E;
    scoreArray1[31][5] = 2;
    scoreArray1[32][5] = 0;
    scoreArray1[33][5] = 11;
    scoreArray1[34][5] = 48;
    scoreArray1[35][5] = 0;
    scoreArray1[36][5] = 12;
    scoreArray1[37][5] = 0;
    
    scoreArray1[40][5] = D;
    scoreArray1[41][5] = 2;
    scoreArray1[42][5] = 0;
    scoreArray1[43][5] = 12;
    scoreArray1[44][5] = 0;
    scoreArray1[45][5] = 0;
    scoreArray1[46][5] = 12;
    scoreArray1[47][5] = 16;
    
    scoreArray1[50][5] = G;
    scoreArray1[51][5] = 2;
    scoreArray1[52][5] = 0;
    scoreArray1[53][5] = 12;
    scoreArray1[54][5] = 16;
    scoreArray1[55][5] = 0;
    scoreArray1[56][5] = 12;
    scoreArray1[57][5] = 32;
    
    scoreArray1[60][5] = B;
    scoreArray1[61][5] = 2;
    scoreArray1[62][5] = 0;
    scoreArray1[63][5] = 12;
    scoreArray1[64][5] = 16;
    scoreArray1[65][5] = 0;
    scoreArray1[66][5] = 12;
    scoreArray1[67][5] = 32;
    
    scoreArray1[0][6] = C;
    scoreArray1[1][6] = 3;
    scoreArray1[2][6] = 0;
    scoreArray1[3][6] = 12;
    scoreArray1[4][6] = 32;
    scoreArray1[5][6] = 0;
    scoreArray1[6][6] = 13;
    scoreArray1[7][6] = 0;
    
    scoreArray1[10][6] = C;
    scoreArray1[11][6] = 2;
    scoreArray1[12][6] = 0;
    scoreArray1[13][6] = 12;
    scoreArray1[14][6] = 32;
    scoreArray1[15][6] = 0;
    scoreArray1[16][6] = 13;
    scoreArray1[17][6] = 0;
    
    scoreArray1[20][6] = E;
    scoreArray1[21][6] = 2;
    scoreArray1[22][6] = 0;
    scoreArray1[23][6] = 12;
    scoreArray1[24][6] = 32;
    scoreArray1[25][6] = 0;
    scoreArray1[26][6] = 13;
    scoreArray1[27][6] = 0;
    
    scoreArray1[30][6] = G;
    scoreArray1[31][6] = 2;
    scoreArray1[32][6] = 0;
    scoreArray1[33][6] = 12;
    scoreArray1[34][6] = 32;
    scoreArray1[35][6] = 0;
    scoreArray1[36][6] = 13;
    scoreArray1[37][6] = 0;
   
    
    int j, k;
    
    for(j=40; j<ARRAY_SIZE_X; j++){
        for(k=6; k<ARRAY_SIZE_Y; k++){
            scoreArray1[j][k] = 0x7FFF;
        }
    }
    
}

int exponentOfTwo(int exp)
{
    int i;
    int result = 1;
    
    for(i=0; i<exp; i++){
        result *= 2;
    }
    
    return result;
}